tutorials/unsteadyStateForcedConvection4NFFoam/abdominalAorticAneurysmDrugDelivery/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  NF4Foam;

nu		nu [0 2 -1 0 0 0 0]	0.808e-06;//It is not read.
Pr		Pr [ 0 0 0 0 0 0 0 ]	5.6;//It is not read.
Prt		Prt [ 0 0 0 0 0 0 0 ]	0.85;
Sct		Sct [ 0 0 0 0 0 0 0 ]	0.85;
// ************************************************************************* //
