tutorials/unsteadyStateForcedConvection4NFFoam/abdominalAorticAneurysmDrugDelivery/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions		[0 1 -1 0 0 0 0];

internalField		uniform (0 0 0);

boundaryField
{
    inlet
    {

	type		uniformVelocityWaveform4NFFoam;
        amplitude	1.0;//D=1.7cm
        frequency	1.0;
        lenDir		(0 0 1);
        fourierSeriesType	complex;//real;
        cosCoeffs	(1.0    1.0    1.0);
        sinCoeffs	(1.0    1.0    1.0);

        real		(1.0    0.4461    -0.7231    -0.3046    0.0042    0.0469    0.0780    0.0256    0.0192    -0.0021);
        imaginary	(1.0    -0.9481    -0.5638    0.3181    0.1447    0.1112    0.0169    -0.0184    -0.0104   -0.0119);

/*
	type		parabolicRadialVelocityWaveformBC4NF;
        amplitude	0.07346513;//D=1.7cm
        frequency	1.2;
        lenDir		(0 0 1);
        radius		0.0085;
        real		(1.0    0.4461    -0.7231    -0.3046    0.0042    0.0469    0.0780    0.0256    0.0192    -0.0021);
        imaginary	(1.0    -0.9481    -0.5638    0.3181    0.1447    0.1112    0.0169    -0.0184    -0.0104   -0.0119);
*/
/*
	type		womersleyRadialVelocityWaveformBC4NF;
        amplitude       0.07346513;//D=1.7cm
        frequency       1.2;
        lenDir          (0 0 1);
        radius          0.0085;
        nu              3.77e-6;
        real            (0.657572293154140    -1.09830259306480    -0.474161203062429    0.0375248655656680    0.0977828946386050    0.109114103510714    0.0538095238095240    -0.00926088768273900    0.00638717595237000    -0.00684433958852800    0.00791728929589200    0.0107610684109730    -0.0201986073631790    0.0190476190476190    -0.0281783538423230    0.0181127188838900    -0.00853178017847300    0.000839113792598237    0.0149817199768250    -0.00694404982778000    0.00261904761904700);
        imaginary            (0.657572293154140    -1.09830259306480    -0.474161203062429    0.0375248655656680    0.0977828946386050    0.109114103510714    0.0538095238095240    -0.00926088768273900    0.00638717595237000    -0.00684433958852800    0.00791728929589200    0.0107610684109730    -0.0201986073631790    0.0190476190476190    -0.0281783538423230    0.0181127188838900    -0.00853178017847300    0.000839113792598237    0.0149817199768250    -0.00694404982778000    0.00261904761904700);
*/

    }

    outlet
    {
	type		zeroGradient;
    }

    front
    {
        type            wedge;
    }

    back
    {
        type            wedge;
    }

    wall
    {
        type           fixedValue;
        value          uniform (0 0 0);
    }

}


// ************************************************************************* //
