tutorials/unsteadyStateForcedConvection4NFFoam/abdominalAorticAneurysmDrugDelivery/0/alpha_Cu
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha_Cu;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions		[0 0 0 0 0 0 0];

internalField		uniform 0.0;

boundaryField
{
    inlet
    {
	type		fixedValue;
	value		uniform 0.01;
    }

    outlet
    {
	type		zeroGradient;
    }

    front
    {
        type            wedge;
    }

    back
    {
        type            wedge;
    }

    wall
    {
	type		buongiorno4NFFoam;
        name            Cu;
        jo              (0.0);
        ho              (0.0);
        alphao          (0.0);
    }

}
// ************************************************************************* //
